;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; 应用序
; num 用于记录调用remainder次数
; flag 用于选择输出结果：falg=0输出gcd结果，falg=1输出调用次数
; (+ num 1)s 是因为应用序求值直接调用了一次
(define (gcd a b num flag)
    (if (= b 0)
        (if (= flag 0)
            a
            num
        )
        (gcd b (remainder a b) (+ num 1) flag)))

(display (gcd 206 40 0 0))
(newline) ;调用结果2
(display (gcd 206 40 0 1))
(newline) ;调用次数4


(exit)     

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; 正则序
; remainder 简记作rem

; (gcd 206 40)
;          ⇩
;          40!=0 
;          ⇩
;          (gcd 40 (rem 206 40) ) (左0次 右1次 暂不计算)
;               ▔ ⇩▔▔▔▔▔▔
;                  (rem 206 40) =40 !=0 【+1次】
;                  ⇩
;                  (gcd (rem 206 40) (rem 40 (rem 206 40)) ) (左1次 右2次 暂不计算)
;                       ▔▔▔▔▔▔  ⇩▔▔▔▔▔▔▔▔▔▔▔
;                                    (rem 40 (rem 206 40)) =6 !=0 【+2次】
;                                    ⇩
;                                    ...太长 前移
                                   
; (gcd (rem 40 (rem 206 40)) (rem (rem 206 40) (rem 40 (rem 206 40))) ) (左2次 右4=(1+2)+1次 暂不计算)
;      ▔▔▔▔▔▔▔▔▔▔▔  ⇩▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔
;                            (rem (rem 206 40) (rem 40 (rem 206 40))) =4 !=0 【+4次】  
;                            ⇩
;                            ...太长 前移
; (gcd (rem (rem 206 40) (rem 40 (rem 206 40)))  (rem (rem 40 (rem 206 40)) (rem (rem 206 40) (rem 40 (rem 206 40)))) ) (左4次 右7=(2+4)+1次 暂不计算)
;      ▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔  ⇩▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔
;                                                (rem (rem 40 (rem 206 40)) (rem (rem 206 40) (rem 40 (rem 206 40)))) =2 !=0 【+7次】 
;                                                ⇩
;                                                ...太长 前移
; (gcd (rem (rem 40 (rem 206 40)) (rem (rem 206 40) (rem 40 (rem 206 40)))) (rem (rem (rem 206 40) (rem 40 (rem 206 40))) (rem (rem 40 (rem 206 40)) (rem (rem 206 40) (rem 40 (rem 206 40))))) ) (左7次 右12=(4+7)+1次 暂不计算)
;      ▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔  ⇩▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔
;                                                                           (rem (rem (rem 206 40) (rem 40 (rem 206 40))) (rem (rem 40 (rem 206 40)) (rem (rem 206 40) (rem 40 (rem 206 40))))) =0 【+12次】 
; 条件满足，已全部展开【+7+12】，故共(1+2+4+7+12) + (7+12) = 45次
; 根据以上规律，可以得出应用序与正则序之间的关系：(每一项都是fib(n+2)-1)
; 若应用序调用n次，则正则序调用次数为： (Σ(fib(n+3)) - (n+3)) + (fib(n+2) + fib(n+2) -2)



